Repository: wescamp/The_Final_Exam-1.12
Catalog: po/*.po
Languages: sk

source: The Final Exam
sk: Posledná skúška

source: TFE
sk: PS

source: Young mage Erika must find a magic book to become a true mage. But will it really be her final exam? (4 scenarios, for beginners and WML coders) This campaign is aimed to be: - easy to play - easy to modify - easy to learn basics of WML - easy to translate
sk: Mladá mágyňa Erika musí nájsť magickú knihu, aby sa stala skutočnou mágyňou. Naozaj to ale bude jej posledná skúška? (4 mapy, pre začiatočníkov a WML kóderov) Cieľom je vytvorenie kampane, ktorá by bola: - jednoduchá na hranie - jednoduchá na úpravy - jednoduchá na učenie WML - jednoduchá na prekladanie

source: (Easy)
sk: Ľahká

source: (Normal)
sk: Normálna

source: (Hard)
sk: Ťažká

source: Campaign Design
sk: Návrh kampane

source: Text and campaign corrections
sk: Úpravy textov a kampane

source: Also many thanks to:
sk: Taktiež veľké poďakovanie pre:

source: Viliam Bur, Db0, Elvish Pillager, Fendrin (fabi) and zookeeper (yes, not capitalized)
sk: Viliam Búr, Db0, Elvish Pillager, Fendrin (fabi) a zookeeper (áno, bez veľkých písmen)

source: Corrections for Wesnoth 1.8
sk: Úpravy pre Wesnoth 1.8

source: 1-Village
sk: 1-Dedina

source: Young mage Erika has just finished her studies. The academy's walls are too constricting for a talented and ambitious mage, and her desires to continue her research in places all over the world are going to be fulfilled. A life of a great magician awaits her, and maybe one day, she'll return back to the academy as a teacher.
sk: Mladá mágyňa Erika práve dokončila svoje štúdia. Brány akadémie sú však pritesné pre talentovanú a ambicionáznu mágyňu, ktorá túži po pokračovaní jej bádania po celom svete. Čaká ju život veľkej kúzelníčky, a možno sa jedného dňa vráti, aby mohla učiť na akadémií ako učiteľka kúziel.

source: But there is still one last obstacle she must get through. Her final exam. She was assigned the task to find a book full of arcane wisdom somewhere in a cave to northeast.
sk: Je tu však jedna posledná prekážka, cez ktorú musí prejsť. Jej posledná skúška. Dostala úlohu získať knihu plnú magických vedomostí kdesi v jaskyni na severovýchode.

source: female^Erika
sk: Erika

source: Defeat Nerek
sk: Porazíš Nereka

source: Death of Erika
sk: Zomrie Erika

source: Would you like to see some beginner tips for this campaign?
sk: Chceš si prezrieť začiatočnícke rady pre túto kampaň?

source: No, thanks. I don't need them.
sk: Nie, ďakujem. Nepotrebujem ich.

source: Yes, please.
sk: Áno, prosím.

source: This campaign has a mage as main character. Keep Erika alive and guard her. Her powerful attack will be important in many battles. She can also heal other units if she becomes a white mage. Alternatively, she can become a red mage to greatly improve her attack.
sk: Táto kampaň má mágyňu ako hlavnú postavu. Udrž Eriku nažive a chráň ju. Jej silný útok je potrebný v boji. Taktiež môže liečiť ostatné jednotky, ak sa stane bielou mágyňou. Alebo sa môže stať červenou mágyňou, čo jej útok značne posilní.

source: There are many reasons, why not fight orcish grunts at night. So fight only if you really need to fight, because you can lose a lot of units that you will need during the day to defeat them.
sk: Je veľa dôvodov, prečo nebojovať s orkskými pešiakmi v noci. Takže bojuj len vtedy, keď musíš, pretože môžeš stratiť veľa svojich jednotiek. A práve veľa bojovníkov potrebuješ počas dňa, aby si porazil súpera.

source: Keep Johnny alive! This bowman can become powerful very quickly and is recalled for free. He can also recruit units, and this can get really important if you want to see Erika in the hardest battle and still recruiting units.
sk: Snaž sa udržať Johnnyho nažive! Tento strelec sa môže stať silným veľmi rýchlo a je automaticky v každej mape zadarmo. Môže taktiež rekrútovať jednotky, čo je dôležité, ak chceš vidieť Eriku v tvrdých bojoch a zároveň rekrútovať.

source: Orcs and trolls are not very good against ranged units. Exploit it! Good strategy is to combine this with healing in villages.
sk: Orkovia a trolovia nie sú veľmi dobrí proti streleckým útokom. Využi to! Dobrá stratégia je kombinovať to s liečením v dedinách.

source: To make 3rd and 4th scenarios easier, try to upgrade Erika and Jessin (first seen on 3rd scenario) as soon as possible. Also, look for a big tree in scenario 3 :)
sk: Aby bola tretia a štvrtá mapa ľahšia, snaž sa vylepšiť Eriku a Jesina (objaví sa v tretej mape) tak rýchlo, ako to len pôjde. Taktiež sa popozeraj po veľkom strome v tretej mape :)

source: Be careful! Don't rush forward as fast as possible, use a slower movement with more units. This will help against enemy ambushes and you will loose less units. Also, think twice in which castle you want to recruit new units.
sk: Buď opatrný! Neuponáhľaj sa, radšej postupuj pomalšie s viac jednotkami. Táto taktika pomôže proti nepriateľským prekvapivým útokom a ty stratíš menej jednotiek. Taktiež si dvakrát premysli, v ktorom hrade budeš rekrútovať nových bojovníkov.

source: To complete my final exam, I have to find a book. It should be somewhere in that cave, if my master is right.
sk: Na splnenie mojej poslednej skúšky, musím nájsť knihu. Bude niekde v tamtej jaskyni, ak má môj majster pravdu.

source: And I will gladly help in your quest. To be honest, I don't like caves a lot, but I will search this one. Just for you.
sk: A ja ti rád pomôžem s tvojou úlohou. Aby som bol úprimný, nemám veľmi v láske jaskyne, ale túto prehľadám. Len pre teba.

source: Hey boys, here comes a silly girl with a few weaklings who look like if they had never seen a fight. They'll be a perfect dinner. Smash them!
sk: Hej banda! Prichádza akési hlúpe dievčatko s pár vojačikmi, ktorí ešte ani z diaľky nevideli boj. Bude z nich perfektná večera! Rozbite ich!

source: I strongly doubt that you can avoid my arrows, orc. You will be pierced, hacked and burned alive!
sk: Dosť pochybujem, že sa dokážeš vyhnúť mojim šípom, ork! Budeš prebodaný, dosekaný a spálený zaživa!

source: Master Jessin and... yes Johnny, also with your help... I can recruit few warriors to aid me. It will be foolish to get past orcs and other dangers alone.
sk: Majster Jesin a... áno Johnny, taktiež s tvojou podporou... môžem rekrútovať pár bojovníkov, ktorí mi pomôžu. Bolo by hlúpe, dostať sa cez tých orkov osamote.

source: Finally, the orcs are defeated. This fight was quite dangerous, their swords cut deep. Our way into the caves should be clear now.
sk: Konečne, orkovia sú porazení. Tento boj bol veľmi nebezpečný, ich meče prenikali hlboko. Naša cesta do jaskýň je teraz čistá.

source: No, no, no, blood on the ground, please, don't be mine...
sk: Nie nie nie, krv na zemi... dúfam, že nie je moja...

source: Aaahh! They got me! I am dying, Erika, help me!
sk: Aaah! Dostali ma! Umieram. Erika, pomôž mi!

source: I cannot help you with that.
sk: S tým ti nepomôžem.

source: Get into that cave and find the book. Don't let me die in vain!
sk: Dostaň sa do jaskyne a nájdi tú knihu. Nedopusť, aby bola moja smrť zbytočná!

source: It will be hard without you, my friend.
sk: Bez teba to bude ťažké, priateľ môj.

source: 2-Cave
sk: 2-Jaskyňa

source: The orcs were beaten, and they are no longer a danger for them. The cave awaits. Will the book be there?
sk: Orkovia sú porazený a už nepredstavujú žiadnu hrozbu. Jaskyňa očakáva. Bude tam tá kniha?

source: Find the book
sk: Nájdi knihu

source: I don't like this place. It's so silent and dark. These conditions fit rather the nocturnal beasts than humans, be very careful!
sk: Nepáči sa mi toto miesto. Je tu len ticho a tma. Tieto podmienky sa hodia skôr pre nočné zvery ako pre ľudí. Buďte opatrní!

source: I have been to a cave like this once. We were travelling, and needed to find some shelter for the night. We were ambushed by a skeleton, we shot like ten arrows into it, and it had almost no effect. My poor friend Darcyn tried to smash its bones with a heavy stick he found nearby, but the skeleton parried it and killed him. We had to flee and walk all night, afraid that the skeleton would chase us.
sk: Kedysi som bol v jaskyni ako je táto. Cestovali sme a potrebovali sme nájsť miesto na strávenie noci. Boli sme napadnutý kostlivcom. Nastrieľali sme do neho snáď i desať šípov, ale nemalo to prakticky žiadny efekt. Môj priateľ Darcyn sa pokúšal rozdrviť jeho kosti s ťažkým palcátom, ktorý našiel neďaleko, ale kostlivec ho zabil na mieste. Museli sme utiecť a kráčali sme celú noc so strachom, že nás doženie.

source: I can hear some heavy steps echoing in the distance, it does not sound like skeletons.
sk: Počujem ťažké kroky, ako sa ozývajú v diaľke. Neznie to ako kostlivec.

source: My grandfather told me about trolls. They live in caves and attack anything that comes nearby.
sk: Môj starý otec mi povedal o troloch. Žijú v jaskyniach a útočia na všetko čo sa priblíži.

source: I hope that it was just an avalanche rolling in the distance... But I'd expect trolls here too.
sk: Dúfam, že to bola len ozvena padajúcich kameňov, ale môžu sa tu nachádzať aj trolovia.

source: The steps are getting closer, and it sounds rather like somebody in iron footgear. Maybe some heavy infantrymen. I wonder what they are doing here, but we might hire them. They are strong, and very effective against skeletons.
sk: Kroky sa približujú a znie to skôr ako keby niekto kráčal v ťažkých kovových čižmách. Možno nejakí ťažkoodenci. Neviem, čo tu robia, ale mohli by sme ich najať. Sú silní a veľmi efektívni proti kostlivcom.

source: Alas, I wish Johnny was still alive and well … Quiet ! I can hear some heavy steps in the distance, might even be trolls! Ah no, I don´t think they wear any iron footgear. Maybe some heavy infantrymen? I wonder what they are doing here ... Nevertheless, I might be able to hire them.
sk: Priala by som si, aby bol Johnny stále nažive a v poriadku. Počujem v diaľke niečo, alebo niekoho. Môžu to byť trolovia. Nie, ich čižmy sú kovové. Ťažkoodenci? Netuším, čo tu robia. Ale na tom nezáleží. Možno by som ich mala najať.

source: Hm, really, should I hire two heavy infandrymen? (40 gold)
sk: Hm, možno... najmem dvoch ťažkých pešiakov? (40 zlata)

source: Hey you! Looking for some gold?
sk: Hej vy! Čo poviete na nejaké tie zlatky?

source: No, no, no, bad idea.
sk: Nie, nie, nie, zlý nápad.

source: Oh no, that skeleton is back! Now I definetly hear him! Prepare yourself!
sk: Ale nie, ten kostlivec sa vrátil! Teraz ho definitívne počujem! Pripravte sa!

source: I don't fear any bone creature without brain.
sk: Nebojím sa ničoho, čo je len z kostí a nemá mozog.

source: What if there is some kind of magical protection against thieves on it? What if only Erika can touch it?
sk: Čo ak je tu nejaká magická ochrana proti zlodejom? Asi by sa mala dotknúť najskôr Erika.

source: There it is! The book of ancient wisdom! Great, I made it! Now I am worthy to advance to a higher rank, I will be a true mage, and no one will ever limit my potential!
sk: Tu je! Kniha starodávnej múdrosti! Výborne, zvládla som to! Teraz budem povýšená, budem skutočná mágyňa a nikto nebude limitovať môj potenciál!

source: Time to go back!
sk: Čas na cestu späť!

source: We have seen enough blood for this errand.
sk: Už sme videli dosť krvi.

source: This accursed errand. It is going to cost me too much. Can you save me from death, Erika?
sk: Celý tento výlet... Ide ma stáť naozaj veľa. Môžeš ma zachrániť od smrti, Erika?

source: That is too serious. I can only heal smaller, minor wounds for now, I wish I could save you!
sk: Toto je príliš vážne. Môžem liečiť menšie rany a tak rada by som ťa teraz zachránila!

source: Please know that... I secretly loved you.
sk: Prosím, vedz že... tajne som ťa miloval.

source: My life will be hard without you, my dear friend.
sk: Môj život bude ťažký bez teba, priateľ môj.

source: 3-Poison
sk: 3-Jed

source: Having completed her final task, Erika became a mage in the kingdom's service. But then, ill times came. Master of the mages, Jessin, is almost killed by an orcish poison. Can Erika save him?
sk: Po skončení jej poslednej úlohy sa Erika stala mágyňou v službách kráľovstva. Ale potom prišli ťažké časy. Majster medzi mágmi, Jesin, je takmer zabitý orkským jedom. Môže ho Erika zachrániť?

source: Cure master Jessin from poison
sk: Vylieč majstra Jesina z jedu

source: Death of Erika or Jessin
sk: Zomrie Erika alebo Jesin

source: Turns run out
sk: Vyprší čas

source: male_mage_name^Jessin
sk: Jesin

source: male_fencer_name^Dask
sk: Dašk

source: elvish_archer^Aceman
sk: Aceman

source: Master! Master!
sk: Majster! Majster!

source: I feel really sick. I think that it was a poison from an orcish throwing knife that hit me a shortly ago. I do not have any antidote for this poison, because it is rarely used by humans..
sk: Necítim sa veľmi dobre. Som otrávený orkským vrhacím nožom, ktorý ma trafil len pred chvíľou. Na tento jed nemám žiadny protijed, pretože ho ľudia prakticky nepoužívajú.

source: How can I cure you?
sk: Ako ťa môžem vyliečiť?

source: In fact, only a white mage can cure me. Or a powerful elvish druid. Maybe you can also find a village, but if my memory still works correctly, the only one in this region is far on the southwest. And maybe you will find a different way... remember, I am very weak now, but still I am able to burn some orcs...
sk: Po pravde, jedine biely mág ma môže vyliečiť. Alebo mocná elfská druidka. Taktiež možno nájdeš dedinu, ale ak mi pamäť dobre slúži, jediná je ďaleko na juhozápade. A možno nájdeš inú cestu... nezabúdaj, že hoci som teraz veľmi slabý, stále môžem pár orkov spáliť na popol...

source: TIP: There are no white mages, but Erika can become one. Also, upgrading Jessin to higher level will cure him as well.
sk: TIP: Nie sú tu bieli mágovia, ale Erika sa ním môže stať. Taktiež vylepšenie Jesina na vyššiu úroveň ho môže vyliečiť.

source: I will cure you, already on it!
sk: Vyliečim ťa, už na tom pracujem!

source: Our leader can help with this poison, but we are in serious trouble right now. Orcs are everywhere and we cannot defeat them ourselves, we need your help!
sk: Naša líderka môže pomôcť s týmto jedom, ale sme to my, kto potrebuje pomoc práve teraz. Orkovia sú všade a my ich nemôžeme poraziť vlastnými silami. Potrebujeme tvoju pomoc!

source: Based on what I have seen, any help might be very useful.
sk: Na základe toho, čo som videl, môže byť akákoľvek pomoc naozaj užitočná.

source: You may not remember me, Erika, but it doesn't matter. I'm Dask, and I am something like a friend to Jessin. Now listen, I've hearded that on that side of the river... well... some trees are very strange. Mostly after a lot of them was burned by orcish fire.
sk: Možno si ma nepamätáš, Erika, ale na tom nezáleží. Som Dask, a som niečo ako priateľ majstra Jesina. Teraz počúvaj pozorne, počul som, že na tej strane rieky... no... niektoré stromy sú naozaj zvláštne. Hlavne po tom, čo ich bolo veľa spálených ohňom orkov.

source: It is an honour for me to be allowed to help people like you.
sk: Je to veľká česť, pomôcť takým ako si ty.

source: Also, many mages wish to fight against orcs. We can recruit some of them.
sk: Taktiež veľa mágov chce bojovať proti orkom. Môžeš ich niekoľko naverbovať.

source: This tree.. wose... is moving! Do not attack this wose, he can help us crush the orcs.
sk: Tento strom... lesný muž... ožíva! Neútočte na neho, môže nám pomôcť rozdrviť orkov.

source: wose_name^Tambaddum
sk: Tambaddum

source: From now on, you can recruit woses in your castle.
sk: Odteraz môžeš verbovať lesných mužov v svojom hrade.

source: I made it, the master of the mages is cured!
sk: Podarilo sa! Majster mágov je vyliečený!

source: There is no bridge over the river. Orcs have burned it down, so we have no choice but to start building the new one.
sk: Cez rieku nie je žiadny most. Orkovia ho spálili a my nemáme inú možnosť, než postaviť nový.

source: Bridge under construction
sk: Rozostavaný most

source: Great, our bridge is now stable enough for us to cross it.
sk: Výborne, náš most je dosť stabilný na to, aby sme po ňom prešli.

source: The weather is changing. I can't see through this thick fog. We cannot track the orcs like we did before.
sk: Počasie sa mení. Vidím už len veľa hmly. Nemôžeme sledovať orkov tak dobre ako predtým.

source: I am dying... Aaargh!
sk: Zomieram... Aaarch!

source: We should have left him die, because this fight is going to be my last.
sk: Mali by sme ho nechať zomrieť, tento boj je tým posledným.

source: Rest in peace, my dear friend.
sk: Odpočívaj v pokoji, priateľ môj.

source: Please know that I... I...
sk: Prosím, vedz že... ja... ja...

source: Hahaha, you will never learn it, foolish girl.
sk: Hahaha, nikdy sa to nedozvieš, hlúpe dievčisko.

source: elves_have_female_leader^Oh, cruel fate, elves are under attack and their leader, skilled in healing, is dead!
sk: Ah, krutý osud! Elfovia sú pod útokom a ich veliteľka, ktorá má skúsenosti s liečením, je mŕtva!

source: I am dying... Aaarch!
sk: Zomieram... Aaarch!

source: 4-Lakes
sk: 4-Jazerá

source: After Jessin became healthy and powerful again, an elven scout arrived, bearing grim news. Another orcish tribe was attacking the elves, and Erika and her small force arrived just in time.
sk: Po tom, čo Jesin vyzdravel a stal sa znovu mocným, prišiel so zlými správami elfský posol. Iný kmeň orkov zaútočil na elfov, a Erika s jej malou armádou dorazila práve včas.

source: male_elvish_ranger^Tarhien
sk: Tarhien

source: Defeat the orcish army
sk: Poraz armádu orkov

source: Death of elvish leader
sk: Zomrie veliteľ elfov

source: Here they are. They gathered a lot of warriors. I am quite sure that they will try to destroy us thanks to their supreme numbers.
sk: Tak a tu sú. Pozbierali množstvo vojakov. Som si istý, že sa nás budú snažiť prevalcovať ich počtami.

source: What can we do to help?
sk: Ako môžeme pomôcť?

source: Destroy them. No matter how, you will figure something out. Bigger army needs more supplies. And gold, of course, can be used to buy them quickly. They have both from villages in the south region. If we somehow get there, we will gain a great advantage. A silver mage might teleport there, I think.
sk: Zničme ich. Je jedno ako, ale na niečo prídeme. Väčšia armáda potrebuje viac zdrojov. A zlata, samozrejme. Obidvoje získavajú z dedín v južnej oblasti. Ak s tam nejako dostaneme, získame veľkú výhodu. Možno by sa tam mohol rýchlo dostať stieborný mág. aspoň dúfam.

source: I love fighting on your side, Erika, by the way. I will do my best to achieve a victory!
sk: Milujem boj po tvojom boku, Erika. To len tak mimochodom. Urobím čo sa bude dať, aby sme dosiahli víťazstvo.

source: I suspect that you love everything about me, Johnny.
sk: Predpokladám, že miluješ všetko, čo so mnou nejako súvisí.

source: I wonder what would Johnny say now if he was still alive... Oh, it still pains my heart!
sk: Môžem len hádať, čo by Johnny povedal, keby bol stále nažive. Bolí ma to pri srdci!

source: male_elvish_champion^Smenofal
sk: Smenofal

source: I hope we came in time.
sk: Dúfam, že sme prišli včas.

source: Orcs will be in a great disadvantage now. They will starve and flee, or simply die. All of it thanks to you, Erika. You are not only a good mage, but also a smart military leader.
sk: Orkovia budú v poriadnej nevýhode. Budú hladovať a ujdú, alebo jednoducho pokapú. Toto je všetko možné vďaka tebe, Erika. Si nielen dobrá mágyňa, ale taktiež šikovná veliteľka v boji.

source: Thank you, master. Not long ago, I was a simple student. Now I can use magic in combat and enjoy fighting alongside friends.
sk: Ďakujem Vám, majster. Nie tak dávno som bola len obyčajná študentka. Ale teraz môžem používať mágiu v boji a bojovať po boku priateľov.

source: Erika's life was very short after she helped both her master and the elves. One night, she was poisoned with an orcish throwing knife and while Erika was able to harm her enemy, poison killed her. Jessin continued to teach young mages and several of them became even grand mages over time, but that is a completely different story...
sk: Erikin život bol veľmi krátky po tom, čo pomohla svojmu majstrovi a elfom. Jednej noci bola otrávená orkským vrhacím nožom a aj keď bola schopná raniť svojho protivníka, zomrela na účinky jedu. Jesin pokračoval v učení mladých mágov a niekoľko z nich sa stalo po dlhých rokoch dokonca veľmágmi, ale to je už úplne iný príbeh...

source: To hell with that orcs! They have defeated me this time. Please, lead your soldiers to victory and don't let my sacrifice be in vain.
sk: Dopekla s orkami! Tentoraz ma porazili. Prosím, veď vojakov do boja a nedovoľ, aby bola moja smrť zbytočná.

source: I promise.
sk: Sľubujem.

source: I like breaking promises too, girl.
sk: Milujem lámanie sľubov, dievčatko.

source: They are everywhere! I... I...
sk: Sú všade! Ja... ja...
